// Задача 15: Напишите программу, которая принимает на
// вход цифру, обозначающую день недели, и проверяет,
// является ли этот день выходным.
// Примеры:
// 6 -> да
// 7 -> да
// 1 -> нет
Console.Clear();
Console.Write("Введите номерт дня недели: ");
int num = int.Parse(Console.ReadLine());
Console.WriteLine((num == 6) || (num == 7) ? $"да" : "нет");